**********************************************************************
*  SAMPLE HLASM PROGRAM
*  Demonstrates basic HLASM constructs for tree-sitter parsing
**********************************************************************
SAMPLE   CSECT
R0       EQU   0
R1       EQU   1
R2       EQU   2
R3       EQU   3
R12      EQU   12
R13      EQU   13
R14      EQU   14
R15      EQU   15
*
         USING *,R15
         STM   R14,R12,12(R13)
         LR    R12,R15
         DROP  R15
         USING SAMPLE,R12
*
* MAIN LOGIC
*
         LA    R1,MSGADDR
         L     R2,=F'80'
         BAL   R14,PROCESS
         B     EXIT
*
PROCESS  DS    0H
         MVC   OUTAREA,0(R1)
         LA    R3,1
         AR    R3,R2
         BR    R14
*
EXIT     DS    0H
         LM    R14,R12,12(R13)
         SR    R15,R15
         BR    R14
*
* DATA AREAS
*
MSGADDR  DC    A(MESSAGE)
MESSAGE  DC    CL80'HELLO FROM HLASM'
OUTAREA  DS    CL80
FWORD    DC    F'200'
HWORD    DC    H'100'
HEXVAL   DC    X'FF00'
BINVAL   DC    B'10101010'
COUNTER  DC    PL4'0'
*
         LTORG
*
         END   SAMPLE
